tevoth/stm32f411/shared/uart_common/src/uart.c
#include <stdint.h>
#include <stdbool.h>
#include "stm32f4xx.h"
#include "system_clock.h"
#include "uart.h"
#include "uart_helpers.h"

#define UART_BAUDRATE 115200
#define UART_WAIT_LIMIT 100000U

static void uart_set_baudrate(uint32_t periph_clk, uint32_t baudrate);
static bool uart_write(int ch);

int __io_putchar(int ch) {
  return uart_write(ch) ? ch : -1;
}

int _write(int file, char *ptr, int len) {
    (void)file;
    if (len < 0) {
        // TODO: optionally set errno for invalid length input.
        return -1;
    }
    if ((ptr == 0) && (len > 0)) {
        // TODO: optionally set errno for invalid buffer input.
        return -1;
    }

    int written = 0;
    for (int i = 0; i < len; i++) {
        if (__io_putchar(*ptr++) < 0) {
            return (written > 0) ? written : -1;
        }
        written++;
    }
    return written;
}

void uart_init(void) {
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;

  GPIOA->PUPDR &= ~(GPIO_PUPDR_PUPDR2_0 | GPIO_PUPDR_PUPDR2_1);
  GPIOA->OTYPER &= ~GPIO_OTYPER_OT2;
  // set to alternative function
  GPIOA->MODER &= ~GPIO_MODER_MODER2_0;
  GPIOA->MODER |=  GPIO_MODER_MODER2_1;
  // set PA2 to AF7
  GPIOA->AFR[0] &= ~(0xF << GPIO_AFRL_AFSEL2_Pos); // Clear all 4 bits for PA2
  GPIOA->AFR[0] |=  (0x7 << GPIO_AFRL_AFSEL2_Pos); // Set PA2 to AF7

  // enable clock to access uart2
  RCC->APB1ENR |= RCC_APB1ENR_USART2EN;
  RCC->APB1RSTR |= RCC_APB1RSTR_USART2RST;
  RCC->APB1RSTR &= ~RCC_APB1RSTR_USART2RST;

  uart_set_baudrate(SYSTEM_PCLK1_HZ, UART_BAUDRATE);

  USART2->CR1 = USART_CR1_TE | USART_CR1_UE;
}

static bool uart_write(int ch) {
  if (!uart_wait_set_limit(&USART2->SR, USART_SR_TXE, UART_WAIT_LIMIT)) {
    return false;
  }

  USART2->DR = (ch & 0xFF);
  return true;
}

static void uart_set_baudrate(uint32_t periph_clk, uint32_t baudrate) {
  USART2->BRR = uart_compute_bd(periph_clk, baudrate);
}
